Revit 2027 API
HVACLoadLoadsReportType Enumeration
 Enumerated type listing possible types of reports generated for HVAC loads.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum HVACLoadLoadsReportType
Public Enumeration HVACLoadLoadsReportType
public enum class HVACLoadLoadsReportType
type HVACLoadLoadsReportType
Members
Member name | Value | Description
CompactReport | 4 |  A compact report including load components, load conditions and engineering checks
DetailedReport | 3 |  A detailed report including orientation breakdowns
NoReport | 0 |  No report
SimpleReport | 1 |  A simple report with summaries
StandardReport | 2 |  A standard report including zones and spaces
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace